list_of_zikr = {
    "morning": [
        {
            "zikr": "СубханАллаһ",
            "translation": "Алла - мінсіз.",
            "source": "Хадис (Сахих әл-Бұхари, 6406)",
            "explanation": "Пайғамбарымыз (оған Алланың сәлемі болсын) бұл сөздерді 33 рет айтуды кеңес берген.",
        },
        {
            "zikr": "Әлхамдулилләһ",
            "translation": "Аллаға мадақ (шүкір).",
            "source": "Құран, 1:2 (Фатиха сүресі)",
            "explanation": "Бұл зікір Аллаға шүкіршілік ету үшін айтылады.",
        },
        {
            "zikr": "Лә хәулә уә лә қууәтә иллә билләһ",
            "translation": "Барлық күш-қуат тек Аллаға тән.",
            "source": "Хадис (Сахих әл-Бұхари, 6406)",
            "explanation": "Бұл дұға қайғы мен қиындыққа түскенде оқылады. Бұл сөздерді Жәннаттың қазынасы деп аталған.",
        },
        {
            "zikr": "Лә иләһә иллә-Аллаһ, уахдәһу лә шәрика ләһ, ләһул-мулк, уә ләһул-хамд, уә һуә ъәлә күлли шәй'ин қадир",
            "translation": "Алладан басқа құлшылыққа лайықты Тәңір жоқ. Ол жалғыз, әрі Оның серігі жоқ. Бүкіл билік Оған тән, әрі барлық мақтау-мадақ Оған ғана лайық. Оның күш-құдіреті барлық нәрсеге толық жетеді.",
            "source": "Хадис",
            "explanation": None
        }
    ],
    "evening": [
        {
            "zikr": "Субханаллаһи уә бихамдиһи, субханаллаһил-Азим",
            "translation": "Алла барлық кемшіліктен пәк, әрі мадақ Оған тән. Ұлы Алла барлық кемшіліктен пәк.",
            "source": "Хадис (Сахих әл-Бұхари, 6406)",
            "explanation": "Пайғамбарымыз (оған Алланың сәлемі болсын): 'Бұл екі сөз өте жеңіл, бірақ таразыда ауыр', - деген.",
        },
        {
            "zikr": "СубханАллаһ",
            "translation": "Алла - мінсіз.",
            "source": "Хадис (Сахих әл-Бұхари, 6406)",
            "explanation": "Пайғамбарымыз (оған Алланың сәлемі болсын) бұл сөздерді 33 рет айтуды кеңес берген.",
        },
        {
            "zikr": "Әлхамдулилләһ",
            "translation": "Аллаға мадақ (шүкір).",
            "source": "Құран, 1:2 (Фатиха сүресі)",
            "explanation": "Бұл зікір Аллаға шүкіршілік ету үшін айтылады.",
        },
        {
            "zikr": "Лә иләһә иллә-Аллаһ, уахдәһу лә шәрика ләһ, ләһул-мулк, уә ләһул-хамд, уә һуә ъәлә күлли шәй'ин қадир",
            "translation": "Алладан басқа құлшылыққа лайықты Тәңір жоқ. Ол жалғыз, әрі Оның серігі жоқ. Бүкіл билік Оған тән, әрі барлық мақтау-мадақ Оған ғана лайық. Оның күш-құдіреті барлық нәрсеге толық жетеді.",
            "source": "Хадис",
            "explanation": None
        }
    ],
    "sleep": [
        {
            "zikr": "Аллаһуммә бисмикә әмуту уә әхя",
            "translation": "Аллаһым! Тек Сенің атыңмен өлеміз және тірілеміз.",
            "source": "Хадис (Сахих әл-Бұхари, 6324)",
            "explanation": "Бұл дұға ұйқыға жатар алдында оқылады. Пайғамбарымыз (оған Алланың сәлемі болсын) бұл сөздерді оқып, Аллаға тәуекел еткен.",
        },
        {
            "zikr": "Әстағфируллаһ",
            "translation": "Мені кешір Аллаһым.",
            "source": "Хадис",
            "explanation": None
        }
    ],
    "anytime": [
        {
            "zikr": "Аллаһу Акбар",
            "translation": "Алла ұлы.",
            "source": "Хадис (Сахих Муслим, 578)",
            "explanation": "Бұл зікір Алланың ұлылығын дәріптеу үшін айтылады.",
        },
        {
            "zikr": "Ләә иләәһә илләә әнтә субхәәнәкә иннии кунту минәз-зоолимиин",
            "translation": "Аллаһым, барлық кемшіліктен пәк және аса даңқты Сенен өзге (құлшылыққа ие) ешбір құдай жоқ. Шынында, мен өзіме зұлымдық еткендерден болдым.",
            "source": "Құран, 21:87 (Сүре Әл-Әнбия, Юнус пайғамбардың дұғасы)",
            "explanation": "Бұл дұға қиындыққа тап болған кезде оқылады. Юнус пайғамбар (оған Алланың сәлемі болсын) киттің ішінде осы сөздерді айтып, Аллаға жалбарынған."
        },
        {
            "zikr": "Робби яссир уа ләә ту`ассир, уә тәммим бил-хайр",
            "translation": "Раббым! Ісімді жеңілдет және қиындата көрме. Бастаған ісімнің қайырлы аяқталуын нәсіп ет!",
            "source": "Хадис (Ахмад ибн Ханбал, 18333)",
            "explanation": "Пайғамбарымыз (оған Алланың сәлемі болсын) қиын жағдайда осы сөздерді айтқан.",
        },
        {
            "zikr": "Әстағфируллаһал-азыим әлләзи лә иләһә иллә һуәл-хайюл-қойум, уә әтубу иләйһи",
            "translation": "Өзінен басқа ешбір тәңір болмаған, мәңгі тірі, әр нәрсені толық басқарып тұрушы Алладан күнәларыма кешірім сұраймын және Оған тәубе етемін.",
            "source": "Хадис",
            "explanation": None
        },
        {
            "zikr": "Субханаллаһи, уәлхамду лиллаһи уә лә иләһә иллә Аллаһу, уә Аллаһу әкбар",
            "translation": "Алла Пәк, барлық мақтау Аллаға, Алладан басқа құдай жоқ, Алла Ұлы.",
            "source": "Хадис",
            "explanation": None
        },
        {
            "zikr": "Йә хайю йәә қайуум, би рахмәтикә әстәғис",
            "translation": "О, Мәңгілік Тірі, барлық нәрсені сақтаушы және қорғаушы; Сенің Мейіріміңмен жәрдем сұраймын.",
            "source": "Хадис",
            "explanation": None
        },
        {
            "zikr": "Аллаһумма ахсин хулуқи",
            "translation": "Аллаһым, мінезімді жақсарта көр!",
            "source": "Хадис (Сунан әт-Тирмизи, 3591)",
            "explanation": "Пайғамбарымыз (оған Алланың сәлемі болсын) өте көркем мінезді болған және үмметіне осы дұғаны оқуды үйреткен.",
        },
        {
            "zikr": "А'узу билләһи минәш-шайтонир-рожиим",
            "translation": "Мен қуылған шайтаннан Аллаға сиынамын.",
            "source": "Құран, 16:98",
            "explanation": "Бұл дұға шайтанның азғыруынан қорғану үшін оқылады.",
        },
    ],
    "friday": [
        {
            "zikr": "Әстағфируллаһәлләзи лә иләһә иллә һуәл хайюл қайиуму уә әтубу иләйһи",
            "translation": "Өзінен басқа ешбір тәңір болмаған, әрдайым тірі, әр нәрсені толық басқарып тұрушы Алладан күнәларыма кешірім сұраймын және Оған тәубе етемін.",
            "explanation": "Бұл дұғаны жұма күні 3 рет айту ұсынылады, бұл күнәлардың кешірілуіне себеп болады."
        }
    ]
}
