list_of_zikr = [
    {
        "zikr": "Ләә иләәһә илләә әнтә субхәәнәкә иннии кунту минәз-зоолимиин",
        "translation": "Аллаһым, барлық кемшіліктен пәк және аса даңқты Сенен өзге (құлшылыққа ие) ешбір құдай жоқ. Шынында, мен өзіме зұлымдық еткендерден болдым.",
        "source": "Құран, 21:87 (Сүре Әл-Әнбия, Юнус пайғамбардың дұғасы)",
        "explanation": "Бұл дұға қиындыққа тап болған кезде оқылады. Юнус пайғамбар (оған Алланың сәлемі болсын) киттің ішінде осы сөздерді айтып, Аллаға жалбарынған."
    },
    {
        "zikr": "Аллаһумма ‘кфинихим бимә шитә",
        "translation": "Я, Аллаһ! Мені олардан өзің қалаған жолмен құтқара көр.",
        "source": "Хадис (Сунан Әбу Дауд, 1537)",
        "explanation": "Бұл дұға қауіп-қатерден, дұшпандардан немесе жаман адамдардан қорғану үшін оқылады.",
    },
    {
        "zikr": "Ләббайк Аллаһумма ләббайк, ләббайкә ләә шәрика ләкә ләббайк, инналхәмда уанни’мәтә ләкә уалмулк, ләә шәрика ләк",
        "translation": "Аллаһым, мен сенің әміріңді орындауға келдім, сенің әміріңе бой ұсындым. Сенің серігің жоқ, сенің әміріңді орындау – менің борышым.",
        "source": "Хадис (Сахих әл-Бұхари, 1549)",
        "explanation": "Пайғамбарымыз (оған Алланың сәлемі болсын) қажылыққа барғанда осы сөздерді жиі қайталайтын.",
    },
    {
        "zikr": "Лә иләһә иллә Аллаһ, уәхдәһу лә шәрикә ләһ",
        "translation": "Алладан басқа Құдай жоқ, Ол - жалғыз, оның серігі жоқ.",
        "source": "Хадис (Сахих Муслим, 2691)",
        "explanation": "Бұл зікірді пайғамбарымыз (оған Алланың сәлемі болсын) күніне 100 рет айтуды ұсынған.",
    },
    {
        "zikr": "Робби яссир уа ләә ту`ассир, уә тәммим бил-хайр",
        "translation": "Раббым! Ісімді жеңілдет және қиындата көрме. Бастаған ісімнің қайырлы аяқталуын нәсіп ет!",
        "source": "Хадис (Ахмад ибн Ханбал, 18333)",
        "explanation": "Пайғамбарымыз (оған Алланың сәлемі болсын) қиын жағдайда осы сөздерді айтқан.",
    },
    {
        "zikr": "Лә хәулә уә лә қууәтә иллә билләһ",
        "translation": "Барлық күш-қуат тек Аллаға тән.",
        "source": "Хадис (Сахих әл-Бұхари, 6406)",
        "explanation": "Бұл дұға қайғы мен қиындыққа түскенде оқылады. Бұл сөздерді Жәннаттың қазынасы деп аталған.",
    },
    {
        "zikr": "Аллаһу Акбар",
        "translation": "Алла ұлы.",
        "source": "Хадис (Сахих Муслим, 578)",
        "explanation": "Бұл зікір Алланың ұлылығын дәріптеу үшін айтылады.",
    },
    {
        "zikr": "СубханАллаһ",
        "translation": "Алла - мінсіз.",
        "source": "Хадис (Сахих әл-Бұхари, 6406)",
        "explanation": "Пайғамбарымыз (оған Алланың сәлемі болсын) бұл сөздерді 33 рет айтуды кеңес берген.",
    },
    {
        "zikr": "Әстағфируллаһ уә әтубу иләйһ",
        "translation": "Алладан кешірім тілеп, Оған тәубе етемін.",
        "source": "Хадис (Сахих әл-Бұхари, 6307)",
        "explanation": "Пайғамбарымыз (оған Алланың сәлемі болсын) күніне 100 рет истиғфар айтатын.",
    },
    {
        "zikr": "Әлхамдулилләһ",
        "translation": "Аллаға мадақ (шүкір).",
        "source": "Құран, 1:2 (Фатиха сүресі)",
        "explanation": "Бұл зікір Аллаға шүкіршілік ету үшін айтылады.",
    },
    {
        "zikr": "Аллаһумма солли ‘алә Мухаммадин уә 'алә әли Мухаммад",
        "translation": "Аллаһым, Мұхаммедке және оның әулетіне салауат айт!",
        "source": "Хадис (Сахих әл-Бұхари, 6357)",
        "explanation": "Пайғамбарымыз (оған Алланың сәлемі болсын): 'Кім маған бір рет салауат айтса, Алла оған он есесін береді', - деген.",
    },
    {
        "zikr": "Аллаһумма иннәкә ъафуун, тухиббулль-ъафуа фаъфу ъанни",
        "translation": "Аллаһым! Сен – Кешірімдісің, кешіруді жақсы көресің, мені де кешіре көр!",
        "source": "Хадис (Сунан ат-Тирмизи, 3513)",
        "explanation": "Айша анамыз пайғамбарымыздан Қадір түні қандай дұға оқуға болатынын сұрағанда, ол осы дұғаны үйреткен.",
    },
    {
        "zikr": "Лә иләһә иллаллаһ, Мухаммадур расулуллаһ",
        "translation": "Алладан басқа Құдай жоқ, Мұхаммед – Оның елшісі.",
        "source": "Құран, 3:18",
        "explanation": "Бұл – исламның негізгі куәлігі, пайғамбарымыз (оған Алланың сәлемі болсын) адамдарды осы сөзге шақырған.",
    },
    {
        "zikr": "А'узу билләһи минәш-шайтонир-рожиим",
        "translation": "Мен қуылған шайтаннан Аллаға сиынамын.",
        "source": "Құран, 16:98",
        "explanation": "Бұл дұға шайтанның азғыруынан қорғану үшін оқылады.",
    },
    {
        "zikr": "Аллаһумма ахсин хулуқи",
        "translation": "Аллаһым, мінезімді жақсарта көр!",
        "source": "Хадис (Сунан әт-Тирмизи, 3591)",
        "explanation": "Пайғамбарымыз (оған Алланың сәлемі болсын) өте көркем мінезді болған және үмметіне осы дұғаны оқуды үйреткен.",
    },
    {
        "zikr": "Субханаллаһи уә бихамдиһи, субханаллаһил-Азим",
        "translation": "Алла барлық кемшіліктен пәк, әрі мадақ Оған тән. Ұлы Алла барлық кемшіліктен пәк.",
        "source": "Хадис (Сахих әл-Бұхари, 6406)",
        "explanation": "Пайғамбарымыз (оған Алланың сәлемі болсын): 'Бұл екі сөз өте жеңіл, бірақ таразыда ауыр', - деген.",
    },
    {
        "zikr": "Аллаһуммә бисмикә әмуту уә әхя",
        "translation": "Аллаһым! Тек Сенің атыңмен өлеміз және тірілеміз.",
        "source": "Хадис (Сахих әл-Бұхари, 6324)",
        "explanation": "Бұл дұға ұйқыға жатар алдында оқылады. Пайғамбарымыз (оған Алланың сәлемі болсын) бұл сөздерді оқып, Аллаға тәуекел еткен.",
    },
]

juma_zikr_info = {
    "zikr": "Әстағфируллаһәлләзи лә иләһә иллә һуәл хайюл қайиуму уә әтубу иләйһи",
    "translation": "Өзінен басқа ешбір тәңір болмаған, әрдайым тірі, әр нәрсені толық басқарып тұрушы Алладан күнәларыма кешірім сұраймын және Оған тәубе етемін.",
    "explanation": "Бұл дұғаны жұма күні 3 рет айту ұсынылады, бұл күнәлардың кешірілуіне себеп болады."
}

suhur_dua = {
    "dua": "Нәуәйту ән асумә саумә шәһри Рамаданә минәл фәжри иләл мағриби халисан лилләһи таъалә. Уа би сауми ғадин науайту мин шахри рамадан.",
    "translation": "Таңертеннен кешке дейін Алланың разылығы үшін Рамазан айының оразасын ұстауға ниет еттім.",
}

iftar_dua = {
    "dua": "Аллаһуммә ләкә сумту уә бикә әәмәнту уә‘аләйкә тәуәккәлту уә‘ала ризқикә әфтарту уә саумәлғади мин шәһри Рамадана нәуәйту, фәғфирлии мәә қаддамту уә мә аххарту.",
    "translation": "Я, Аллам! Сенің ризалығың үшін ораза ұстадым. Сенің берген ризығыңмен аузымды аштым. Саған иман етіп, саған тәуекел жасадым. Рамазан айының ертеңгі күнінде де ауыз бекітуге ниет еттім. Менің өткен және келешек күнәларымды кешір гөр!",
}

tarauyh_dua = {
    "dua": "Субхаанә зил-мүлки уәл-мәләкүүт. Субханә зил-иззәтә уәл-азамәти уәл-құдрати уәл-кибрия-и уәл-жәбәруут. Субханәл-мәлики-хаййл-ләзи лә йәмуут. Суббуухун құддуусұн раббүна уә раббүл-мәләәикәти уәррууһ. Ләә иләәһә иллаллаһү нәстәғфирұллааһ нәсәлүкәл жәннәтә уә нә узү бикә минәннар.",
    "translation": "Патшалық және мүліктер иесі Алла пәк. Үстемдік, ұлылық, құдірет, үлкендік және өктемдік иесі Алла пәк. Өлмейтін (мәңгі) тірі (патшалардың) патша Алла пәк. Өте пәк, тым кіршіксіз Раббымыз, әрі періштелердің Раббы, әрі Жәбірейілдің Раббы, Алладан басқа ешбір Жаратушы жоқ. Алладан жарылқау тілеймін. Я, бір Алла! Сенен жәннат тілеймін және тозақ отынан сақта деп саған сыйынамын."
}